 //1)Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. 
 //Проверьте работу скрипта при a, равном 5, 0, -3, 2.

 let a = 3;
 let b = 5;


 if (a > 0 && a < 5) {
     console.log("Верно");
 } else {
     console.log("Неверно");
 }


 //2)Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. 
 //Выведите новое значение переменной в консоль. Проверьте работу скрипта при a, равном 5, 0, -3, 2.

 if (a == 0 || a == 2) {
     console.log(a + 7);
 } else {
     console.log(a / 10);
 }


 //3)Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, 
 //иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.

 if (a <= 1 && b >= 3) {
     console.log(a + b);
 } else {
     console.log(a - b);
 }


 //4)Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', 
 //в противном случае выведите 'Неверно'. 

 if (a > 2 && a < 11 || b >= 6 && b < 14) {
     console.log("Верно");
 } else {
     console.log("Неверно");
 }